import random
def main():
    print()
    print('Вітаю! Для початку гри натисність Enter')

    def choose_fate():
        '''користувач вибирає можливі режими'''
        fate = input('>>> ') 
        if fate == '1' :
            print('Ти вибрала теорiю, розпочнемо :D')
            theory_game()
        elif fate == '2':
            print('Ти вибрала практику, хай щастить!')
            practice_mode()
        elif fate =='вихід':
            quit()
        else:
            print('''
            Упс...У нас немає такої команди(
            Спрoбуй знову

            Для роботи з теорією натисни 1
            Для роботи з практикою натисни 2
            Напиши 'вихід' , щоб вийти з гри''')
            choose_fate()

    def game_starting():
        '''початок гри, представлення можливих режимів'''
        text = input(">>> ")
        if text == "":
            print('''
        Вітаю Гертрудо... 
        На який бік підеш? 
        -Теорія!(це необхідна річ для практики)
        -Практика!(можливо цього разу тобі пощастить)
        (ти можеш вийти з гри в будь який момент, для цього напиши 'вихід' без лапок.)

        Для роботи з теорією натисни 1
        Для роботи з практикою натисни 2
        Напиши 'вихід' , щоб вийти з гри
        Нехай щастить!''')
            choose_fate()
        elif text == 'вихід':
            quit()
        else:
            print('Такої команди немає :( Для початку гри натисність Enter')
            game_starting()

    def theory_choice():
        '''функція, яка забезпечує можливість виходу з теоритичного режиму
        або виходу з гри'''
        theory_choice = input('''Йдемо далі?(так/ні)
        так- перекидаємо в лоббі теорії
        ні- перекидаємо в загальне лоббі\n>>> ''')
        if theory_choice == 'так':
            theory_game()
        elif theory_choice == 'ні':
            print('Повертаємо тебе до лоббі. Для початку гри натисни Enter')
            game_starting()
        elif theory_choice == 'вихід':
            quit()
        else:
            theory_choice = input('''Добре, ознайомлюйся з інформацією.
            Натиснеш, коли будеш готовий.\nЙдемо далі?(так/ні)\n>>> ''')

    def theory_game():
        '''все, що відбувається всередині теоритичної частини гри'''
        criterii =''
        while criterii != 'папір' or criterii != 'пластик'  or criterii != 'скло' or criterii != 'метал' or criterii !='вихід':
            print('''Сміття сортується по певних критеріях:
            папір, пластик, скло, метал
            Напишіть назву критерія, щоб почути про нього більше інформації.''')
            criterii = input('>>> ')
            if criterii == 'папір':
                print('''Паперові відходи, які підлягають переробці:
                -картонне пакування, коробки;
                -гільзи від рулону;
                -папір (офісний, глянцевий, кольоровий)
                -паперові пакети;
                -видавнича продукція;
                -блокноти і зошити;
                -паперові одноразові стаканчики (з цим окремі контейнери));
                -Tetra Pak / Pure Pak (але сортуються, як правило, окремо!);
                -коркові пробки;
                -лотки з-під яєць.\n''')
                print('''Паперові відходи, які НЕ підлягають переробці:
                -серветки, рушники, туалетний папір;
                -пергамент (якщо він брудний, жирний і має залишки їжі);
                -еколін (обгортка від масла, сиру тощо);
                -стікери;
                -шпалери;
                -чеки;
                -ламінований папір;
                -крейдований папір;
                -паперова продукція зі слідами фарби або хімічних речовин.\n''')
                print('''Як підготувати папір до переробки
                1. Видаліть залишки їжі – паперовий виріб повинен бути чистим,
                сухим,не забрудненим жиром. Упаковки Tetra Pak / Pure Pak вимийте і висушіть.
                2. Видаліть залишки скотчу, скріпки, скоби, файли, зшивачі, якщо вони є.
                3. Складіть всю макулатуру щільно. З упаковок типу Tetra Pak / Pure Pak
                видаліть повітря і стисніть, щоб вони займали менше місця.\n''')
                theory_choice()
            elif criterii == 'пластик':
                print('''Пластикові відходи, які піддаються переробці:
                (01) Поліетилентерефталат – PET (E) або ПЕТ:
                -пляшки з водою, безалкогольними напоями, пивом, олією,
                -пляшки з молочними продуктами, косметичною продукцією \n
                (02) Поліетилен високої щільності(PEHD або HDPE.):
                -пляшки для харчових (молоко, соки) рідин
                -пляшки для нехарчових рідин (миючі засоби, косметика, шампуні, гелі для душу)
                -кришки, каністри для моторного та інших автомобільних мастил.\n 
                (04) Поліетилен низької щільності – LDPE або PEBD:  
                -пакети, які не шарудять, а тягнуться, пакети для сміття
                -іграшки, лінолеум, брезенти, плівки, ємності, що гнуться. \n
                (05) Поліпропілен – PP або ПП.:
                -харчові контейнери та посуд, кришки для пляшок, диски
                -пляшки для сиропів і соусів, шприци, інгалятори
                -баночки, тари, стаканчики для йогурту, упаковки для фотоплівок,
                іграшки\n''')
                print('''Пластикові відходи, які не переробляються:
                -файлики
                -пластикові картки
                -блістери від пігулок
                -папки пластикові
                -палички для розмішування цукру, соломинки
                -"шуршики", тобто легкі і тонкі упаковки від чіпсів, цукерок,
                інших пакетів, у яких зберігається їжа.
                -поліетиленові пакети
                -пласткові тонкі коробки для зберігання і підігріввання їжі, 
                якщо у них немає маркування, то вони можуть лише спалюватись\n
                (06) Полістирол – PS. 
                -деякі харчові упаковки (одноразовий посуд, чашки, прилади) \n
                (03) Полівінілхлорид (PVC або ПВХ)
                -іграшки, пластикові вікна, підлогові покриття, елементи меблів,
                скатертини, натяжні стелі, шланги, жалюзі.
                -"шуршики", тобто легкі і тонкі упаковки від чіпсів, цукерок,
                інших пакетів, у яких зберігається їжа.
                -поліетиленові пакети
                -пласткові тонкі коробки для зберігання і підігріввання їжі, 
                якщо у них немає маркування, то вони можуть лише спалюватись\n
                ''')
                print('''Як підготувати пластик до переробки:
                1. Помити, просушити
                2. Подивитись маркування на пачках і дізнатись, які пункти приймають його''')

            elif criterii == 'метал':
                print('''Металеві відходи, які підлягають переробці:
                -Консервні та алюмінієві бляшанки;
                -Фольга та контейнери із фольги;
                -Металеві кришечки;
                -Металевий посуд;
                -Алюмінієві тюбики;
                -Банки з-під фарби;
                -Алюмінієві гільзи з-під свічок;
                -Металеві каністри. \n''')
                print('''Металеві відходи, які НЕ підлягають переробці:
                -Аерозольні балони (деякі станції можуть приймати);
                -Станки для гоління;
                -Батарейки. \n''')
                print('''Як сортувати й підготувати метал до переробки
                1. Промити та висушити;
                2. За можливості стиснути, аби металевий виріб займав менше місця.
                \n''')
                theory_choice()

            elif criterii == 'скло':
                print('''Скляні відходи, які підлягають переробці:
                -Скляні пляшки;
                -Скляний посуд;
                -Бите скло;
                -Скляні бляшанки з-під парфумів, ліків; \n''')
                print('''Скляні відходи, які НЕ підлягають переробці:
                -Кераміка;
                -Кришталь;
                -Жаростійке скло;
                -Ударостійке скло;
                -Дзеркала. \n''')
                print('''Як сортувати й підготувати скло до переробки:
                1. Забруднений скляний виріб варто вимити та просушити.
                2. Кришечки з-під пляшок варто сортувати разом із металом 
                або пластиком, в залежності від типу матеріалу;
                3. Етикетки можна лишити на пляшці, так як вони 
                відокремлюються в процесі переробки. \n''')
                theory_choice()
            elif criterii =='вихід':
                quit()

    def practice_mode():
        '''Початок практичного режиму'''
        print('''Вітаю в інтерактивному режимі сонце.\n
        Що ж, Гертрудо, я бачу, ти хочеш переглянути рішення магістра
        про виселення з колегіуму...
        А якщо б ти відповідально сортувала, нічого би не сталось...\n''')
        print('''Чи зможеш ти справитись цього разу?
        Сортувати сміття не так вже й легко, ти сама бачила...\n''')
        print('''Я думаю, що  ти старалась і вчила теорію, 
        можливо цього разу тобі пощастить?!\n
        За кожну правильну відповідь ти отримаєш +1 бал.
        За кожну неправильну, відповідно, -1.\n''')
        print('''Набереш 10 балів, зможеш повернутись.
        Але якщо ти втратиш всі бали, то доведеться пробувати наступного року!\n''')
        print('''
        Натисни 1, якщо бажаєш продовжити гру 
        Натисни 2, якщо бажаєш повернутись в лоббі
        Напиши 'вихід' , щоб вийти з гри''')
        practic_choice()

    def practic_choice():
        '''вибір користувачем, чи залишатись у практиці, чи повертатись у лоббі,
        чи виходити з гри'''
        practice_choice = input('>>> ')
        if practice_choice =='1' :
            print('Супер, перейдемо до найважливішого')
            practice_game()
        elif practice_choice =='2':
            print('Повертаємо тебе до лоббі. Для початку гри натисніть Enter')
            game_starting()
        elif practice_choice == 'вихід':
            quit()
        else:
            print('''
            Упс...У нас немає такої команди(
            Спрoбуй знову
            Натисни 1, якщо бажаєш продовжити гру і перейти до інтерактивного режиму
            Натисни 2, якщо бажаєш повернутись в лоббі''')
            practic_choice()
    right_things = ['пляшка від води','пляшка від пива, пластикова',
    'каністра від машинного масла, помита', 'пляшечка від шампуню, мита',
    'стаканчик від йогурту, митий',
    'помита пластикова тара для їжі, з маркуванням',
    'консервна бляшанка, мита', 'металева кришечка', 'фольга',
    'помита скляна пляшка від соку', 'скляна тарілочка' , 'бите скло' ,
    'папір офісний', 'тетра-пак' , 'блокнот для записів' ,
    'картонні коробки' , 'паперові стаканчики', 'лотки з-під яєць',
    'коркові пробки','кришка до пляшки']
    wrong_things = ['непомита пляшка від кефіру','одноразовий посуд, помитий',
    'пляшка від соку з залишками соку','пластикова ємкість від кетчупу, непомита',
    'упаковка від печива, шурхотить','поліетиленова плівка від молока'
    'поліетиленова упаковка від гречки','пластикова тара для їжі без маркування',
    'упаковка від мівінки','пакет з АТБ','соломинка','блістери від пігулок',
    'аерозольний балон' , 'батарейка' , 'кераміка' , 'кришталь' , 'дзеркало' ,
    'пластикові вікна', 'салфетка зі шмарклями' , 'чек' , 'туалетний папір' ,
    'обгортка від масла чи сиру', 'брудний пергамент з залишками їжі' ,
    'папір зі скотчем']

    all_things = right_things + wrong_things
    def practice_game():
        '''Практичний режим, набір балів у форматі гри'''
        print('+3 бали за красиві очі, сонце!\n')
        count = 3
        while count > 0 and count < 10:
            # for i in all_things(це чисто для мене, щоб легше було провести паралелі)
            i = random.choice(all_things)
            print(f'|{i}|')
            answer=' '
            while answer not in ['так','ні','вихід']:

                answer = input('Ця річ перероблюється?(так/ні)\n>>> ')
                if answer =='так':
                    if i in right_things:
                        print('\n>так! Вона переробляється<')
                        count +=1
                        print(f'Твій рахунок:{count}\n')
                    else:
                        print('ні, подруго, повтори теорію!')
                        count -=1
                        print(f'Твій рахунок:{count}\n')
            
                elif answer =='ні':
                    if i in wrong_things:
                        print('\nтак! Вона не переробляється')
                        count +=1
                        print(f'Твій рахунок:{count}\n')
                    else :
                        print('\nні, подруго, повтори теорію!<')
                        count -=1
                        print(f'Твій рахунок:{count}\n')
                elif answer =='вихід':
                    quit()    
            all_things.remove(i)
        if count == 0:
            print('Ти програла! Спробуй наступного року...')
            quit()
        if count == 10:
            print('Ти виграла! Збирай манатки і чекаємо тебе на крилі.')
            quit()


    game_starting()
    practice_mode()

if __name__=="__main__":
    main()
